---
type: FilterDialog
namespace: Autodesk.Revit.UI
version: 2024
members: 7
tags: [revit-api, class]
---

# FilterDialog

`Autodesk.Revit.UI.FilterDialog` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FilterDialog | — | `` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | Show | 2015 | `public void Show ()` |
| Property | FilterToSelect | 2015 | `public ElementId FilterToSelect { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | NewFilterId | 2015 | `public ElementId NewFilterId { get ; }` |
| Property | NewFilterName | 2015 | `public string NewFilterName { get ; set ; }` |